IdeaRS.Connections
FinPlateData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.FinPlateData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.FinPlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class FinPlateData : PlateDataBase,
	IBoltableData
The FinPlateData type exposes the following members.
Constructors
Name | Description
FinPlateData
 Constructor
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
ConnectionType
 Gets or sets the type of connection of two parts.
CreateNotch
 If true notch is generated automatically
Fastening
 Gets or sets the properties of the anchoring
Gap
 Gets or sets the gap of connected member from related member plate.
IsActive |  (Inherited from ConnectionCmdData.)
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member1Part
 Gets or sets the plate, through which the beam is connected
MemberFlangesWeld
 Gets or sets the properties of the member weld - flanges
MemberWeld
 Gets or sets the properties of the member weld - other parts
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NotchOffset
 Gets or sets the value for notch offset
OffsetBottom
 Gets or sets the bottom offset of the base plate boundary in the horizontal direction (the width of the plate). The size of the base plate is based on the circumscribed box of the column.
OffsetTop
 Gets or sets the top offset of the base plate boundary in the horizontal direction (the width of the plate). The size of the base plate is based on the circumscribed box of the column.
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Overlap
 Gets or sets the overlap of fin plate over connected member.
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PlateWeld
 Gets or sets the properties of the plate weld
PositionCode
 Gets or sets the fin plate position. Supported is left, right and both.
RelatedMember
 Gets or sets the related member (other members are connected to this member)
RemainingPart
 Gets or sets the information, whether fin plate is at the begin or at the end of added member.
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace